# ####################################################################

#  Created by Genus(TM) Synthesis Solution 22.17-s071_1 on Fri Jan 16 20:15:35 -03 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design topo

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_clock_transition 1.0 [get_clocks clk]
set_load -pin_load 0.04 [get_ports {debug_WB[31]}]
set_load -pin_load 0.04 [get_ports {debug_WB[30]}]
set_load -pin_load 0.04 [get_ports {debug_WB[29]}]
set_load -pin_load 0.04 [get_ports {debug_WB[28]}]
set_load -pin_load 0.04 [get_ports {debug_WB[27]}]
set_load -pin_load 0.04 [get_ports {debug_WB[26]}]
set_load -pin_load 0.04 [get_ports {debug_WB[25]}]
set_load -pin_load 0.04 [get_ports {debug_WB[24]}]
set_load -pin_load 0.04 [get_ports {debug_WB[23]}]
set_load -pin_load 0.04 [get_ports {debug_WB[22]}]
set_load -pin_load 0.04 [get_ports {debug_WB[21]}]
set_load -pin_load 0.04 [get_ports {debug_WB[20]}]
set_load -pin_load 0.04 [get_ports {debug_WB[19]}]
set_load -pin_load 0.04 [get_ports {debug_WB[18]}]
set_load -pin_load 0.04 [get_ports {debug_WB[17]}]
set_load -pin_load 0.04 [get_ports {debug_WB[16]}]
set_load -pin_load 0.04 [get_ports {debug_WB[15]}]
set_load -pin_load 0.04 [get_ports {debug_WB[14]}]
set_load -pin_load 0.04 [get_ports {debug_WB[13]}]
set_load -pin_load 0.04 [get_ports {debug_WB[12]}]
set_load -pin_load 0.04 [get_ports {debug_WB[11]}]
set_load -pin_load 0.04 [get_ports {debug_WB[10]}]
set_load -pin_load 0.04 [get_ports {debug_WB[9]}]
set_load -pin_load 0.04 [get_ports {debug_WB[8]}]
set_load -pin_load 0.04 [get_ports {debug_WB[7]}]
set_load -pin_load 0.04 [get_ports {debug_WB[6]}]
set_load -pin_load 0.04 [get_ports {debug_WB[5]}]
set_load -pin_load 0.04 [get_ports {debug_WB[4]}]
set_load -pin_load 0.04 [get_ports {debug_WB[3]}]
set_load -pin_load 0.04 [get_ports {debug_WB[2]}]
set_load -pin_load 0.04 [get_ports {debug_WB[1]}]
set_load -pin_load 0.04 [get_ports {debug_WB[0]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[31]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[30]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[29]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[28]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[27]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[26]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[25]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[24]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[23]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[22]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[21]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[20]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[19]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[18]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[17]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[16]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[15]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[14]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[13]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[12]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[11]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[10]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[9]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[8]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[7]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[6]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[5]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[4]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[3]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[2]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[1]}]
set_load -pin_load 0.04 [get_ports {debug_ALUResult[0]}]
set_load -pin_load 0.04 [get_ports {debug_inst[31]}]
set_load -pin_load 0.04 [get_ports {debug_inst[30]}]
set_load -pin_load 0.04 [get_ports {debug_inst[29]}]
set_load -pin_load 0.04 [get_ports {debug_inst[28]}]
set_load -pin_load 0.04 [get_ports {debug_inst[27]}]
set_load -pin_load 0.04 [get_ports {debug_inst[26]}]
set_load -pin_load 0.04 [get_ports {debug_inst[25]}]
set_load -pin_load 0.04 [get_ports {debug_inst[24]}]
set_load -pin_load 0.04 [get_ports {debug_inst[23]}]
set_load -pin_load 0.04 [get_ports {debug_inst[22]}]
set_load -pin_load 0.04 [get_ports {debug_inst[21]}]
set_load -pin_load 0.04 [get_ports {debug_inst[20]}]
set_load -pin_load 0.04 [get_ports {debug_inst[19]}]
set_load -pin_load 0.04 [get_ports {debug_inst[18]}]
set_load -pin_load 0.04 [get_ports {debug_inst[17]}]
set_load -pin_load 0.04 [get_ports {debug_inst[16]}]
set_load -pin_load 0.04 [get_ports {debug_inst[15]}]
set_load -pin_load 0.04 [get_ports {debug_inst[14]}]
set_load -pin_load 0.04 [get_ports {debug_inst[13]}]
set_load -pin_load 0.04 [get_ports {debug_inst[12]}]
set_load -pin_load 0.04 [get_ports {debug_inst[11]}]
set_load -pin_load 0.04 [get_ports {debug_inst[10]}]
set_load -pin_load 0.04 [get_ports {debug_inst[9]}]
set_load -pin_load 0.04 [get_ports {debug_inst[8]}]
set_load -pin_load 0.04 [get_ports {debug_inst[7]}]
set_load -pin_load 0.04 [get_ports {debug_inst[6]}]
set_load -pin_load 0.04 [get_ports {debug_inst[5]}]
set_load -pin_load 0.04 [get_ports {debug_inst[4]}]
set_load -pin_load 0.04 [get_ports {debug_inst[3]}]
set_load -pin_load 0.04 [get_ports {debug_inst[2]}]
set_load -pin_load 0.04 [get_ports {debug_inst[1]}]
set_load -pin_load 0.04 [get_ports {debug_inst[0]}]
set_load -pin_load 0.04 [get_ports {debug_WA[4]}]
set_load -pin_load 0.04 [get_ports {debug_WA[3]}]
set_load -pin_load 0.04 [get_ports {debug_WA[2]}]
set_load -pin_load 0.04 [get_ports {debug_WA[1]}]
set_load -pin_load 0.04 [get_ports {debug_WA[0]}]
set_load -pin_load 0.04 [get_ports debug_RegWrite]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports rst]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WB[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_ALUResult[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_inst[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WA[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WA[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WA[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WA[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {debug_WA[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports debug_RegWrite]
set_input_transition -min 0.1 [get_ports clk]
set_input_transition -max 1.0 [get_ports clk]
set_input_transition -min 0.1 [get_ports rst]
set_input_transition -max 1.0 [get_ports rst]
set_wire_load_mode "enclosed"
set_clock_latency  0.3 [get_clocks clk]
set_clock_latency -source 0.5 [get_clocks clk]
set_clock_uncertainty -setup 1.0 [get_clocks clk]
